{
  "intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day", "Hey", "Ekse", "Hi"],
     "responses": ["Hi stranger", "Yebo yes, how can I help", "Ey watsupp", "Namaste", "Hola", "Hey dude", "You again"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Ok bye", "Bye Bye"],
     "responses": ["See you!", "Have a nice day", "Sure Bye", "Later dude", "Sayoonara", "Peace out", "Sure dude", "Ciao"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome", "Sure dude"]
    },
    {"tag": "noanswer",
     "patterns": [],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "I am still here dude"]
     },
     {"tag": "name",
      "patterns": ["What is your name", "Whats your name", "Tell me your name", "Who are you", "Kaun ho tum", "Tell me about yourself", "You are"],
      "responses": ["I am chatbot of Batch 1", "My name is TheemBot", "You can call me TheemBot", "I am TheemBot, my friends call me TB", "Karabo is my name"]
      },
      {"tag": "options",
       "patterns": ["What do you do", "How can you help", "What do you know", "What is your purpose", "How can you help"],
       "responses": ["I can tell you about India", "I can give you interesting facts about India"]
      },
     {"tag": "india_info",
      "patterns": ["India", "What can you tell me about SA", "SA", "Tell me about SA", "What about SA", "What do you know about SA", "Tell me more about SA", "What can you tell me about South Africa", "Tell me about South Africa", "What about South Africa", "What do you know about South Africa", "Tell me more about South Africa"],
      "responses": ["India is the country in the South Asia, it has a population of more than 2.5 billions people and covers an area of 1221 037m2. South Africa has 11 official languages. The currency used in ZAR our South African Rand which trades at about 15ZAR per 1USD."]
      },
      {"tag": "india_facts",
       "patterns": ["India Facts", "IN Facts", "Give me some facts about India", "Give me some facts about India", "India Facts", "India interesting facts", "India facts", "India interesting facts", "Tell me something interesting"],
       "responses": [
        "India is now the only country in the world to have largest democracy",
        "India is one of the oldest civilizations in the world with a kaleidoscopic variety and rich cultural heritage. It has achieved all-round socio-economic progress since its Independence. India has become self-sufficient in agricultural production and is now one of the top industrialized countries in the world and one of the few nations to have gone into outer space to conquer nature for the benefit of the people. It covers an area of 32,87,263 sq. km, extending from the snow-covered Himalayan heights to the tropical rain forests of the south. As the 7th largest country in the world, India stands apart from the rest of Asia, marked off as it is by mountains and the sea, which give the country a distinct geographical entity. Bounded by the Great Himalayas in the north, it stretches southwards and at the Tropic of Cancer, tapers off into the Indian Ocean between the Bay of Bengal on the east and the Arabian Sea on the west.",
        "The name 'India' is derived from the River Indus, the valleys around which were the home of the early settlers. The Aryan worshippers referred to the river Indus as the Sindhu.",
        "The Indian peninsula is separated from mainland Asia by the Himalayas. The Country is surrounded by the Bay of Bengal in the east, the Arabian Sea in the west, and the Indian Ocean to the south. Lying entirely in the Northern Hemisphere, the Country extends between 8째 4' and 37째 6' latitudes north of the Equator, and 68째 7' and 97째 25' longitudes east of it and measures about 3,214 km from north to south between the extreme latitudes and about 2,933 km from east to west between the extreme longitudes. It has a land frontier of about 15,200 km. The total length of the coastline of the mainland, Lakshadweep Islands and Andaman & Nicobar Islands is 7,516.6 km.",
        "The History of India begins with the birth of the Indus Valley Civilization, more precisely known as Harappan Civilization. It flourished around 2,500 BC, in the western part of South Asia, what today is Pakistan and Western India. The Indus Valley was home to the largest of the four ancient urban civilizations of Egypt, Mesopotamia, India and China. Nothing was known about this civilization till 1920s when the Archaeological Department of India carried out excavations in the Indus valley wherein the ruins of the two old cities, viz. Mohenjodaro and Harappa were unearthed. The ruins of buildings and other things like household articles, weapons of war, gold and silver ornaments, seals, toys, pottery wares, etc., show that some four to five thousand years ago a highly developed Civilization flourished in this region. Followed by Vedic Civilization, The Buddhist Era, Alexander's Invasion, Gupta Dynasty, Hardhavardhana and many more.",
        "For a period that has come to be so strongly associated with the Islamic influence and rule in India, Medieval Indian history went for almost three whole centuries under the so-called indigenous rulers, that included the Chalukyas, the Pallavas, the Pandyas, the Rashtrakutas, the Muslims rulers and finally the Mughal Empire. The most important dynasty to emerge in the middle of the 9th century was that of the Cholas. The Palas  -  The Senas  -  The Pratihara  -  The Rashtrakutas  -  The Chola Empire of the South  -  The Rise of Islam in South - Asia  -  Timur's Invasion  -  Vijayanagar Empire  -  Bhakti Movement  -  The Mughal Empire  -  Rise of the Sikh Power.",
        "India, a union of states, is a Sovereign, Secular, Democratic Republic with a Parliamentary system of Government. The President is the constitutional head of Executive of the Union. In the states, the Governor, as the representative of the President, is the head of Executive. The system of government in states closely resembles that of the Union. There are 28 states and 8 Union territories in the country. Union Territories are administered by the President through an Administrator appointed by him/her. From the largest to the smallest, each State/UT of India has a unique demography, history and culture, dress, festivals, language etc.",
        "Afghanistan and Pakistan to the north-west; China, Bhutan and Nepal to the north; Myanmar to the east; and Bangladesh to the east of West Bengal. Sri Lanka is separated from India by a narrow channel of sea, formed by Palk Strait and the Gulf of Mannar."
       ]
      }
  ]
}
